nagyjose/DP/Kontrola_Syst/STM32_WPAN/App/app_ble.c
#if (BLE_CFG_PERIPHERAL == 1)
  role |= GAP_PERIPHERAL_ROLE;
#endif

#if (BLE_CFG_CENTRAL == 1)
  role |= GAP_CENTRAL_ROLE;
#endif

  if (role > 0)
  {
    const char *name = "STM32WB";
    aci_gap_init(role, 0,
                 APPBLE_GAP_DEVICE_NAME_LENGTH,
                 &gap_service_handle, &gap_dev_name_char_handle, &gap_appearance_char_handle);

    if (aci_gatt_update_char_value(gap_service_handle, gap_dev_name_char_handle, 0, strlen(name), (uint8_t *) name))
    {
      BLE_DBG_SVCCTL_MSG("Device Name aci_gatt_update_char_value failed.\n");
    }
  }

  if(aci_gatt_update_char_value(gap_service_handle,
                                gap_appearance_char_handle,
                                0,
                                2,
                                (uint8_t *)&appearance))
  {
    BLE_DBG_SVCCTL_MSG("Appearance aci_gatt_update_char_value failed.\n");
  }
/**
   * Initialize Default PHY
   */
  hci_le_set_default_phy(ALL_PHYS_PREFERENCE,TX_2M_PREFERRED,RX_2M_PREFERRED); 

  /**
   * Initialize IO capability
   */
  BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.ioCapability = CFG_IO_CAPABILITY;
  aci_gap_set_io_capability(BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.ioCapability);

  /**
   * Initialize authentication
   */
  BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.mitm_mode = CFG_MITM_PROTECTION;
  BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.OOB_Data_Present = 0;
  BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.encryptionKeySizeMin = 8;
  BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.encryptionKeySizeMax = 16;
  BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.Use_Fixed_Pin = 1;
  BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.Fixed_Pin = 111111;
  BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.bonding_mode = 1;
  for (index = 0; index < 16; index++)
  {
    BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.OOB_Data[index] = (uint8_t) index;
  }

  aci_gap_set_authentication_requirement(BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.bonding_mode,
                                         BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.mitm_mode,
                                         0,
                                         0,
                                         BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.encryptionKeySizeMin,
                                         BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.encryptionKeySizeMax,
                                         BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.Use_Fixed_Pin,
                                         BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.Fixed_Pin,
                                         0
  );

  /**
   * Initialize whitelist
   */
   if (BleApplicationContext.BleApplicationContext_legacy.bleSecurityParam.bonding_mode)
   {
     aci_gap_configure_whitelist();
   }
}

static void Adv_Request(APP_BLE_ConnStatus_t NewStatus)
{
	tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
	uint16_t Min_Inter, Max_Inter;

	if (NewStatus == APP_BLE_FAST_ADV)
	{
		Min_Inter = AdvIntervalMin;
		Max_Inter = AdvIntervalMax;
	}
	else
	{
		Min_Inter = CFG_LP_CONN_ADV_INTERVAL_MIN;
		Max_Inter = CFG_LP_CONN_ADV_INTERVAL_MAX;
	}

	// =========================================================================
	// 1. BEZPEČNÉ VYČTENÍ JMÉNA Z VOLATILE FLASH PAMĚTI
	// =========================================================================
	char temp_name[32] = {0};

	// Kopírujeme bajt po bajtu, dokud nenarazíme na konec textu (\0)
	for(int i = 0; i < 31; i++) {
		temp_name[i] = DEVICE_CONFIG->BLE_device_name[i];
		if(temp_name[i] == '\0') break;
	}
	temp_name[31] = '\0'; // Pojistka proti přetečení

	uint8_t name_len = strlen(temp_name);

	// Ochrana: Kdyby byl čip vymazaný, dáme záchranné jméno
	if (name_len == 0) {
		strcpy(temp_name, "Neznamy");
		name_len = 7;
	} else if (name_len > 25) {
		// Ochrana BLE paketu - jméno nesmí zabrat celých 31 bajtů
		name_len = 25;
	}

	// =========================================================================
	// 2. SESTAVENÍ POLE PRO BLE ADVERTISING
	// =========================================================================
	uint8_t local_name[32];

	// BLE vyžaduje, aby první bajt určoval typ informace (Zde: Kompletní jméno)
	local_name[0] = AD_TYPE_COMPLETE_LOCAL_NAME;

	// Za tento typ nakopírujeme samotné jméno
	memcpy(&local_name[1], temp_name, name_len);

	// Celková velikost k odeslání je délka jména + 1 bajt (AD_TYPE)
	uint8_t local_name_size = name_len + 1;

	uint8_t adv_data[] =
	{
	 0x02,AD_TYPE_TX_POWER_LEVEL,0x00, /* 0 dBm */
	 /* Manufacturer specific data */
	 0x06, AD_TYPE_MANUFACTURER_SPECIFIC_DATA, 0x30, 0x00, 0x00, 0x00, 0x00
	};

	// =========================================================================
	// 3. REGISTRACE DO BLUETOOTH VYSÍLAČE
	// =========================================================================
	ret = aci_gap_set_discoverable(
		ADV_IND,
		Min_Inter,
		Max_Inter,
		GAP_PUBLIC_ADDR,
		NO_WHITE_LIST_USE, /* use white list */
		local_name_size,   /* NAŠE DYNAMICKÁ VELIKOST */
		local_name,        /* NAŠE DYNAMICKÉ JMÉNO */
		sizeof(adv_data),
		(uint8_t*) &adv_data,
		0,
		0);

	/* Update Advertising data */
	//ret = aci_gap_update_adv_data(sizeof(adv_data), (uint8_t*) &adv_data);

	if (ret == BLE_STATUS_SUCCESS)
	{
		if (NewStatus == APP_BLE_FAST_ADV)
		{
			APP_DBG("  \r\n\r");
			APP_DBG("** ADV START FAST ** \r\n\r");
		}
		else
		{
			APP_DBG("  \r\n\r");
			APP_DBG("** ADV START LP ** \r\n\r");
		}
	}
	else
	{
		APP_DBG("** ADV START FAILED ** \r\n\r");
	}

	return;
}


const uint8_t* BleGetBdAddress( void )
{
  uint8_t *otp_addr;
  const uint8_t *bd_addr;
  uint32_t udn;
  uint32_t company_id;
  uint32_t device_id;

